package by.pavelpavlenko.multithreading.view;

public class PrinterInfo {

    public void printInfo(){

        System.out.println("1 - прочитать матрицу с файла" + '\n'
                + "2 - заполнить диагональные элементы при помощи локера" + '\n'
                + "3 - заполнить диагональные элементы при помощи щеколды" + '\n'
                + "4 - заполнить диагональные элементы при помощи барьера" + '\n'
                + "5 - заполнить диагональные элементы при помощи семафора" + '\n'
                + "6 - вывести матрицу на экран" + '\n'
                + "7 - записать матрицу в новый файл" + '\n'
                + "8 - выход");
    }

}
